---
kind: type
id: T:Autodesk.Revit.DB.Events.ViewPrintedEventArgs
source: html/8d683cd4-c19b-034f-8b42-653b024e7aa4.htm
---
# Autodesk.Revit.DB.Events.ViewPrintedEventArgs

The event arguments used by the ViewPrinted event.

## Syntax (C#)
```csharp
public class ViewPrintedEventArgs : RevitAPIPostDocEventArgs
```